Import dependencies

In [1]:
import pandas as pd
import os

Deliverable 1: Collect the Data

In [2]:
#1 A path to access the dataset was created, then it was stored as a Data frame
full_student_data = os.path.join('../Resources/new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

Deliverable 2: Prepare the Data

In [3]:
#2.1 Review for incomplete data rows
student_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19514 entries, 0 to 19513
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   student_id     19514 non-null  int64
 1   student_name   19514 non-null  object
 2   grade          19514 non-null  object
 3   school_name    19514 non-null  object
 4   reading_score  17546 non-null  float64
 5   math_score     18532 non-null  float64
 6   school_type    19514 non-null  object
 7   school_budget  19514 non-null  int64
dtypes: float64(2), int64(2), object(4)
memory usage: 1.2+ MB

this is a markdown

In [4]:
student_df.count()

student_id       19514
student_name     19514
grade            19514
school_name      19514
reading_score    17546
math_score       18532
school_type      19514
school_budget    19514
dtype: int64

In [5]:
#2.2 Incomplete rows are eliminated and the corrected data set is previewed
student_df = student_df.dropna(how='any')
student_df.count()
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9th,Montgomery High School,63.5,76.9,Charter,893368

In [6]:
#2.3 Identify duplicated values
student_df.duplicated()
student_df.duplicated().sum()

1836

In [7]:
#2.4 Elimination of duplicated values in the data frame. Review the data has been corrected.
student_df = student_df.drop_duplicates()
student_df.duplicated()

0        False
1        False
2        False
3        False
5        False
         ...
19508    False
19509    False
19511    False
19512    False
19513    False
Length: 14831, dtype: bool

In [8]:
#2.5 Review data types within the data set
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [9]:
#Review values for "grade" column
student_df["grade"].value_counts()

10th    4398
9th     4132
11th    3197
12th    3104
Name: grade, dtype: int64

In [10]:
#2.6 Data in the column "grade" is changed from str to int. Change is visualized with value_counts()
student_df['grade'] = student_df['grade'].replace(
    {'9th': 9, '10th': 10, '11th': 11, '12th': 12})

student_df["grade"].value_counts()

10    4398
9     4132
11    3197
12    3104
Name: grade, dtype: int64

In [11]:
#Column type is already int, but to change it it would be: student_df["grade"] = pd.to_numeric(student_df["grade"])
student_df["grade"].dtype

dtype('int64')

Deliverable 3: Summarize the Data

In [12]:
#3.1 Central tendency and distribution properties of the numerical data are shown using describe()
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [13]:
#3.2 Average of the "math score" is calculated
student_df["math_score"].mean()

64.67573326141189

In [14]:
#3.3 Minimum reading score is stored as a variable
min_reading_score = student_df["reading_score"].min()
min_reading_score

10.5

Deliverable 4: Drill Down into the Data

In [15]:
#4.1 Displaying only the "grade" column.
student_df.loc[:, "grade"]

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int64

In [16]:
#4.2 Displaying the first 3 rowsof columns 3,4, and 5.
student_df.iloc[0:3,3:6]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [17]:
#4.3 Summary statistics only for 9th grade 
grade_9 = student_df.loc[student_df["grade"] == 9,:]
grade_9.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [18]:
#4.4 Row with the minimum overall reading score saved 
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score,:]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [19]:
#4.5 Show all reading scores from 10th graders at Dixon High School
grade10_reading = student_df.loc[(student_df["grade"] == 10) & (student_df["school_name"] == "Dixon High School") , ["school_name","reading_score"]]
grade10_reading

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [20]:
#4.6 Average of the reading score for all 11th and 12th graders
grade11and12_reading = student_df.loc[(student_df["grade"] == 11) | (student_df["grade"] == 12), "reading_score"]
grade11and12_reading.mean()

74.90038089192188

Deliverable 5: Compare the Data

In [21]:
#5.1 Display the average budget for each school type
school_type_vs_budget = student_df.groupby("school_type") 
school_type_vs_budget["school_budget"].mean()

school_type
Charter    872625.656236
Public     911195.558251
Name: school_budget, dtype: float64

In [22]:
#5.2 Show total number of students per school in descending order
school_vs_student_count = student_df[['school_name','student_id']].groupby(by='school_name').count()
school_vs_student_count.sort_values(by='student_id',ascending=False)

                        student_id
school_name
Montgomery High School        2038
Green High School             1961
Dixon High School             1583
Wagner High School            1541
Silva High School             1109
Woods High School             1052
Sullivan High School           971
Turner High School             846
Bowers High School             803
Fisher High School             798
Richard High School            551
Campos High School             541
Odonnell High School           459
Campbell High School           407
Chang High School              171

In [23]:
#5.3 Calculate the average math score for each school type
school_type_vs_math = student_df.groupby(['school_type', 'grade']).mean()
school_type_vs_math.loc[:,"math_score"]

school_type  grade
Charter      9        70.077874
             10       66.443206
             11       68.024735
             12       60.212121
Public       9        63.771066
             10       63.764121
             11       59.314337
             12       63.568319
Name: math_score, dtype: float64

Deliverable 6: Summarize Your Findings

In [ ]:
#1. Data cleaning
# This exercise showed the importance of reviewing the data set for missing and duplicate values before further assessment, it is very convenient 
# that Pandas has specific methods for that, which makes it much more intuitive than cleaning data through repetitive actions in Excel, for example. 
#
# 2. Data description 
# Being able to preview the dataset provides actionable information, for example the "Grades" subset reveal that there are more students in 9th and 10th grade 
# than 11th and 12th grade, this could potentially mean that an important number of students could be dropping out of school, depending on the school administration
# the reason behind that could be reviewed.
# Using .describe we can see that the average score on mathematics is 64.675733 while for reading the average score is 72.357865, both parameters 
# should be improved however you could argue the more resources to make mathematics more appealing to the students.
#
# 3. Dataset and subset comparison
# Pandas provides great tools to filter, summarize and compare subsets of the data frame allowing you to review from a macro school district view 
# or turn to an specific school and adapt to their precise needs and development opportunities.
# An additional analysis that could of importance would be quantity of students and budget assigned to the school, and compare that with the
# average budget for each school-type table since the last one revealed that public school have on average a higher budget than charter schools
# however this higher budget could be diluted in a bigger student population.